# 13. Напишите подпрограмму def prog_13(a, b), которая возвращает сумму целых положительных чисел, больших 20, меньших 100, кратных 3 и заканчивающихся на 2, 4 или 8.
# непонятно зачем нужны a и b - сделаем их границами интервала
def prog_13(a=20, b=100):
    result = 0
    for i in range(a + 1, b):
        if i > 0 and i % 3 == 0 and i % 10 in (2, 4, 8):
            result += i
    return result


# 14. Напишите подпрограмму def prog_14() поиска трёхзначного числа, удовлетворяющего следующему условию: в числе зачеркнули первую цифру слева, полученное двузначное число умножили на 7 и получили данное число.

def prog_14():
    for i in range(100, 1000):
        if i == i % 100 * 7:
            return i
    return None


# 15. Напишите подпрограмму def prog_15() поиска всех трёхзначных чисел, делящихся на 7, сумма цифр которых также кратна 7.
def prog_15():
    result = []
    for i in range(100, 1000):
        if i % 7 == 0 and sum0(i) % 7 == 0:
            result.append(i)
    return result


# функция находящая сумму цифр числа
def sum0(number):
    r = 0  # остаток от деления
    result = 0
    while number > 0:
        r = number % 10
        number = int(number / 10)
        result += r

    return result


if __name__ == '__main__':
    # test
    print("Результат вызова подпрограммы prog_13(a, b):")
    print(prog_13(20, 100))
    # test2
    print("Результат вызова подпрограммы prog_14():")
    print(prog_14())
    # test3
    print("Результат вызова подпрограммы prog_15():")
    print(prog_15())
